```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=si38]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-09-06 15:05:45.180094074 +0000 UTC]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-09-06 15:05:45.336175481 +0000 UTC]
module.dns.module.dns["nonlive"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/8135d581-d413-41d4-986c-d9ce3a96a52a]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.dns.module.dns["live"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/2d620bca-b6a9-4c69-b045-9874dcbf5f30]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/345cace1-2d73-4acc-a44f-d45752deb801]
module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/46955869-b3c7-4936-b463-5caea37eb3f5]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_kms_key.cloudtrail: Refreshing state... [id=f206c800-14d0-4612-86cd-bd6b80b2045e]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2777606739]
module.aws_logging.aws_cloudtrail.cloudtrail: Refreshing state... [id=cloudtrail]
module.dns.module.dns["nonlive"].aws_route53_zone.zone: Refreshing state... [id=Z09185361UA62H9QOZ65H]
module.dns.module.dns["live"].aws_route53_zone.zone: Refreshing state... [id=Z09171243VWGB0AD4XJAE]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.module.dns["nonlive"].aws_route53_record.verification_record["scaffoldly.dev"]: Refreshing state... [id=Z09185361UA62H9QOZ65H__5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev._CNAME]
module.dns.module.dns["live"].aws_route53_record.verification_record["scaffold.ly"]: Refreshing state... [id=Z09171243VWGB0AD4XJAE__7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly._CNAME]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.access_logs_group: Refreshing state... [id=/aws/apigateway/example-nonlive-access-logs]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.access_logs_group: Refreshing state... [id=/aws/apigateway/example-live-access-logs]
module.aws_api_gateway.module.domain["nonlive"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffoldly.dev]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-nonlive]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-live]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_rest_api.api: Refreshing state... [id=b6ujqgrvd7]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_rest_api.api: Refreshing state... [id=m1oxmvsuek]
module.aws_api_gateway.module.domain["live"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffold.ly]
module.aws_api_gateway.module.domain["nonlive"].aws_route53_record.api_record: Refreshing state... [id=Z09185361UA62H9QOZ65H_api.scaffoldly.dev_A]
module.aws_api_gateway.module.domain["live"].aws_route53_record.api_record: Refreshing state... [id=Z09171243VWGB0AD4XJAE_api.scaffold.ly_A]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_m1oxmvsuek/nonlive]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-b6ujqgrvd7-DEFAULT_4XX]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_resource.health: Refreshing state... [id=vl6zab]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_resource.health: Refreshing state... [id=q9m9iw]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_b6ujqgrvd7/live]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-m1oxmvsuek-DEFAULT_4XX]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-m1oxmvsuek-q9m9iw-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-b6ujqgrvd7-vl6zab-GET]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_response.health_get_response_200: Refreshing state... [id=agmr-m1oxmvsuek-q9m9iw-GET-200]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-m1oxmvsuek-q9m9iw-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-b6ujqgrvd7-vl6zab-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_response.health_get_response_200: Refreshing state... [id=agmr-b6ujqgrvd7-vl6zab-GET-200]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration_response.health_get_response_200: Refreshing state... [id=agir-b6ujqgrvd7-vl6zab-GET-200]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration_response.health_get_response_200: Refreshing state... [id=agir-m1oxmvsuek-q9m9iw-GET-200]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment: Refreshing state... [id=hq7bmc]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment: Refreshing state... [id=nv184z]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-m1oxmvsuek-nonlive]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-b6ujqgrvd7-live]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings: Refreshing state... [id=b6ujqgrvd7-live-*/*]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings: Refreshing state... [id=m1oxmvsuek-nonlive-*/*]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping: Refreshing state... [id=api.scaffoldly.dev/example]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping: Refreshing state... [id=api.scaffold.ly/example]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.assume_cloudformation_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_cloudformation_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.cloudformation will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudformation"  {
      + id      = "3853530454"
      + json    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "arn:*:iam::*:role/serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "cloudformation:UpdateStack",
                          + "cloudformation:PreviewStackUpdate",
                          + "cloudformation:List*",
                          + "cloudformation:Get*",
                          + "cloudformation:Describe*",
                          + "cloudformation:CreateStack",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:cloudformation:*:*:stack/serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "cloudformation:ValidateTemplate"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:s3:::serverless-example-api*/*",
                          + "arn:*:s3:::serverless-example-api*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:ListAllMyBuckets",
                          + "s3:CreateBucket",
                          + "s3:*Notification*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "apigateway:PUT",
                          + "apigateway:POST",
                          + "apigateway:PATCH",
                          + "apigateway:OPTIONS",
                          + "apigateway:HEAD",
                          + "apigateway:GET",
                          + "apigateway:DELETE",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:apigateway:*::/usageplans/*",
                          + "arn:*:apigateway:*::/usageplans*",
                          + "arn:*:apigateway:*::/restapis/*",
                          + "arn:*:apigateway:*::/restapis*",
                          + "arn:*:apigateway:*::/apis/*",
                          + "arn:*:apigateway:*::/apis*",
                          + "arn:*:apigateway:*::/apikeys/*",
                          + "arn:*:apigateway:*::/apikeys*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = "logs:DescribeLogGroups"
                      + Effect   = "Allow"
                      + Resource = "arn:*:logs:*:*:log-group::log-stream:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:FilterLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DeleteLogStream",
                          + "logs:DeleteLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:logs:*:*:log-group:/aws/lambda/serverless-example-api*:log-stream:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "events:RemoveTargets",
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                          + "events:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:events:*:*:rule/serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "lambda:Update*",
                          + "lambda:Untag*",
                          + "lambda:Tag*",
                          + "lambda:Remove*",
                          + "lambda:Publish*",
                          + "lambda:List*",
                          + "lambda:Invoke*",
                          + "lambda:Get*",
                          + "lambda:Delete*",
                          + "lambda:Create*",
                          + "lambda:Add*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "lambda:*"
                      + Effect   = "Allow"
                      + Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "lambda:*EventSourceMapping*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateTable*",
                          + "dynamodb:UpdateContinuousBackups",
                          + "dynamodb:RestoreTable*",
                          + "dynamodb:List*",
                          + "dynamodb:GetShardIterator",
                          + "dynamodb:Describe*",
                          + "dynamodb:DeleteTable*",
                          + "dynamodb:CreateTable*",
                          + "dynamodb:*Tag*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
                          + "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "xray:*SamplingRule*",
                          + "xray:*Group*",
                          + "xray:*EncryptionConfig*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version = "2012-10-17"

      + statement {
          + actions       = [
              + "iam:PassRole",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:iam::*:role/serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "cloudformation:CreateStack",
              + "cloudformation:Describe*",
              + "cloudformation:Get*",
              + "cloudformation:List*",
              + "cloudformation:PreviewStackUpdate",
              + "cloudformation:UpdateStack",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:cloudformation:*:*:stack/serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "cloudformation:ValidateTemplate",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
      + statement {
          + actions       = [
              + "s3:*",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:s3:::serverless-example-api*",
              + "arn:*:s3:::serverless-example-api*/*",
            ]
        }
      + statement {
          + actions       = [
              + "s3:*Notification*",
              + "s3:CreateBucket",
              + "s3:ListAllMyBuckets",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
      + statement {
          + actions       = [
              + "apigateway:DELETE",
              + "apigateway:GET",
              + "apigateway:HEAD",
              + "apigateway:OPTIONS",
              + "apigateway:PATCH",
              + "apigateway:POST",
              + "apigateway:PUT",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:apigateway:*::/apikeys*",
              + "arn:*:apigateway:*::/apikeys/*",
              + "arn:*:apigateway:*::/apis*",
              + "arn:*:apigateway:*::/apis/*",
              + "arn:*:apigateway:*::/restapis*",
              + "arn:*:apigateway:*::/restapis/*",
              + "arn:*:apigateway:*::/usageplans*",
              + "arn:*:apigateway:*::/usageplans/*",
            ]
        }
      + statement {
          + actions       = [
              + "logs:DescribeLogGroups",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:logs:*:*:log-group::log-stream:*",
            ]
        }
      + statement {
          + actions       = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DeleteLogGroup",
              + "logs:DeleteLogStream",
              + "logs:DescribeLogStreams",
              + "logs:FilterLogEvents",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:logs:*:*:log-group:/aws/lambda/serverless-example-api*:log-stream:*",
            ]
        }
      + statement {
          + actions       = [
              + "events:DeleteRule",
              + "events:DescribeRule",
              + "events:PutRule",
              + "events:PutTargets",
              + "events:RemoveTargets",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:events:*:*:rule/serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "lambda:Add*",
              + "lambda:Create*",
              + "lambda:Delete*",
              + "lambda:Get*",
              + "lambda:Invoke*",
              + "lambda:List*",
              + "lambda:Publish*",
              + "lambda:Remove*",
              + "lambda:Tag*",
              + "lambda:Untag*",
              + "lambda:Update*",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:lambda:*:*:function:serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "lambda:*",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:lambda:*:*:function:serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "lambda:*EventSourceMapping*",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
      + statement {
          + actions       = [
              + "dynamodb:*Tag*",
              + "dynamodb:CreateTable*",
              + "dynamodb:DeleteTable*",
              + "dynamodb:Describe*",
              + "dynamodb:GetShardIterator",
              + "dynamodb:List*",
              + "dynamodb:RestoreTable*",
              + "dynamodb:UpdateContinuousBackups",
              + "dynamodb:UpdateTable*",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
              + "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "xray:*EncryptionConfig*",
              + "xray:*Group*",
              + "xray:*SamplingRule*",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
    }

  # module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.deployer will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deployer"  {
      + id      = "1350816066"
      + json    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:s3:::serverless-example-api*/*",
                          + "arn:*:s3:::serverless-example-api*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:ListAllMyBuckets",
                          + "s3:CreateBucket",
                          + "s3:*Notification*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "cloudformation:UpdateStack",
                          + "cloudformation:DeleteStack",
                          + "cloudformation:CreateStack",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:cloudformation:*:*:stack/serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "cloudformation:ValidateTemplate",
                          + "cloudformation:PreviewStackUpdate",
                          + "cloudformation:List*",
                          + "cloudformation:Get*",
                          + "cloudformation:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "apigateway:GET"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:apigateway:*::/apikeys/*",
                          + "arn:*:apigateway:*::/apikeys*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "apigateway:POST",
                          + "apigateway:PATCH",
                          + "apigateway:GET",
                          + "apigateway:DELETE",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:apigateway:*::/domainnames/*",
                          + "arn:*:apigateway:*::/domainnames*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = "lambda:*"
                      + Effect   = "Allow"
                      + Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "xray:*SamplingRule*",
                          + "xray:*Group*",
                          + "xray:*EncryptionConfig*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version = "2012-10-17"

      + statement {
          + actions       = [
              + "s3:*",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:s3:::serverless-example-api*",
              + "arn:*:s3:::serverless-example-api*/*",
            ]
        }
      + statement {
          + actions       = [
              + "s3:*Notification*",
              + "s3:CreateBucket",
              + "s3:ListAllMyBuckets",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
      + statement {
          + actions       = [
              + "cloudformation:CreateStack",
              + "cloudformation:DeleteStack",
              + "cloudformation:UpdateStack",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:cloudformation:*:*:stack/serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "cloudformation:Describe*",
              + "cloudformation:Get*",
              + "cloudformation:List*",
              + "cloudformation:PreviewStackUpdate",
              + "cloudformation:ValidateTemplate",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
      + statement {
          + actions       = [
              + "apigateway:GET",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:apigateway:*::/apikeys*",
              + "arn:*:apigateway:*::/apikeys/*",
            ]
        }
      + statement {
          + actions       = [
              + "apigateway:DELETE",
              + "apigateway:GET",
              + "apigateway:PATCH",
              + "apigateway:POST",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:apigateway:*::/domainnames*",
              + "arn:*:apigateway:*::/domainnames/*",
            ]
        }
      + statement {
          + actions       = [
              + "lambda:*",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:lambda:*:*:function:serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "xray:*EncryptionConfig*",
              + "xray:*Group*",
              + "xray:*SamplingRule*",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
    }

  # module.serverless_api["example"].module.aws_iam.aws_iam_access_key.access_key will be created
  + resource "aws_iam_access_key" "access_key" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "serverless-example-api-deployer"
    }

  # module.serverless_api["example"].module.aws_iam.aws_iam_role.cloudformation will be created
  + resource "aws_iam_role" "cloudformation" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "cloudformation.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless-example-api-cloudformation"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.serverless_api["example"].module.aws_iam.aws_iam_role_policy.cloudformation_policy will be created
  + resource "aws_iam_role_policy" "cloudformation_policy" {
      + id     = (known after apply)
      + name   = "base-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "arn:*:iam::*:role/serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "cloudformation:UpdateStack",
                          + "cloudformation:PreviewStackUpdate",
                          + "cloudformation:List*",
                          + "cloudformation:Get*",
                          + "cloudformation:Describe*",
                          + "cloudformation:CreateStack",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:cloudformation:*:*:stack/serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "cloudformation:ValidateTemplate"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:s3:::serverless-example-api*/*",
                          + "arn:*:s3:::serverless-example-api*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:ListAllMyBuckets",
                          + "s3:CreateBucket",
                          + "s3:*Notification*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "apigateway:PUT",
                          + "apigateway:POST",
                          + "apigateway:PATCH",
                          + "apigateway:OPTIONS",
                          + "apigateway:HEAD",
                          + "apigateway:GET",
                          + "apigateway:DELETE",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:apigateway:*::/usageplans/*",
                          + "arn:*:apigateway:*::/usageplans*",
                          + "arn:*:apigateway:*::/restapis/*",
                          + "arn:*:apigateway:*::/restapis*",
                          + "arn:*:apigateway:*::/apis/*",
                          + "arn:*:apigateway:*::/apis*",
                          + "arn:*:apigateway:*::/apikeys/*",
                          + "arn:*:apigateway:*::/apikeys*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = "logs:DescribeLogGroups"
                      + Effect   = "Allow"
                      + Resource = "arn:*:logs:*:*:log-group::log-stream:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:FilterLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DeleteLogStream",
                          + "logs:DeleteLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:logs:*:*:log-group:/aws/lambda/serverless-example-api*:log-stream:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "events:RemoveTargets",
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                          + "events:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:events:*:*:rule/serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "lambda:Update*",
                          + "lambda:Untag*",
                          + "lambda:Tag*",
                          + "lambda:Remove*",
                          + "lambda:Publish*",
                          + "lambda:List*",
                          + "lambda:Invoke*",
                          + "lambda:Get*",
                          + "lambda:Delete*",
                          + "lambda:Create*",
                          + "lambda:Add*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "lambda:*"
                      + Effect   = "Allow"
                      + Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "lambda:*EventSourceMapping*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateTable*",
                          + "dynamodb:UpdateContinuousBackups",
                          + "dynamodb:RestoreTable*",
                          + "dynamodb:List*",
                          + "dynamodb:GetShardIterator",
                          + "dynamodb:Describe*",
                          + "dynamodb:DeleteTable*",
                          + "dynamodb:CreateTable*",
                          + "dynamodb:*Tag*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
                          + "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "xray:*SamplingRule*",
                          + "xray:*Group*",
                          + "xray:*EncryptionConfig*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "serverless-example-api-cloudformation"
    }

  # module.serverless_api["example"].module.aws_iam.aws_iam_user.user will be created
  + resource "aws_iam_user" "user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "serverless-example-api-deployer"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.assume_cloudformation_role will be created
  + resource "aws_iam_user_policy" "assume_cloudformation_role" {
      + id     = (known after apply)
      + name   = "assume-cloudformation-role"
      + policy = (known after apply)
      + user   = "serverless-example-api-deployer"
    }

  # module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.policy will be created
  + resource "aws_iam_user_policy" "policy" {
      + id     = (known after apply)
      + name   = "base-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:s3:::serverless-example-api*/*",
                          + "arn:*:s3:::serverless-example-api*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:ListAllMyBuckets",
                          + "s3:CreateBucket",
                          + "s3:*Notification*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "cloudformation:UpdateStack",
                          + "cloudformation:DeleteStack",
                          + "cloudformation:CreateStack",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:cloudformation:*:*:stack/serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "cloudformation:ValidateTemplate",
                          + "cloudformation:PreviewStackUpdate",
                          + "cloudformation:List*",
                          + "cloudformation:Get*",
                          + "cloudformation:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "apigateway:GET"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:apigateway:*::/apikeys/*",
                          + "arn:*:apigateway:*::/apikeys*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "apigateway:POST",
                          + "apigateway:PATCH",
                          + "apigateway:GET",
                          + "apigateway:DELETE",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:*:apigateway:*::/domainnames/*",
                          + "arn:*:apigateway:*::/domainnames*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = "lambda:*"
                      + Effect   = "Allow"
                      + Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "xray:*SamplingRule*",
                          + "xray:*Group*",
                          + "xray:*EncryptionConfig*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "serverless-example-api-deployer"
    }

  # module.serverless_api["example"].module.secrets.github_actions_secret.deployer_aws_access_key will be created
  + resource "github_actions_secret" "deployer_aws_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.serverless_api["example"].module.secrets.github_actions_secret.deployer_aws_secret_key will be created
  + resource "github_actions_secret" "deployer_aws_secret_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date      = "2020-09-06T15:07:09Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-east-1:656889719924:b6ujqgrvd7/bootstrap" -> (known after apply)
      ~ id                = "hq7bmc" -> (known after apply)
      ~ invoke_url        = "https://b6ujqgrvd7.execute-api.us-east-1.amazonaws.com/bootstrap" -> (known after apply)
        rest_api_id       = "b6ujqgrvd7"
        stage_description = "A basic stage created to remediate a race condition in API Gateway"
        stage_name        = "bootstrap"
      ~ triggers          = { # forces replacement
          ~ "redeployment" = "6690e39686a476094a22bf063a315753f007fead" -> "b23ec66f8d9c21f9901a0b54e7b6000a72b08602"
        }
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "stage" {
        arn                   = "arn:aws:apigateway:us-east-1::/restapis/b6ujqgrvd7/stages/live"
        cache_cluster_enabled = false
      ~ deployment_id         = "hq7bmc" -> (known after apply)
        execution_arn         = "arn:aws:execute-api:us-east-1:656889719924:b6ujqgrvd7/live"
        id                    = "ags-b6ujqgrvd7-live"
        invoke_url            = "https://b6ujqgrvd7.execute-api.us-east-1.amazonaws.com/live"
        rest_api_id           = "b6ujqgrvd7"
        stage_name            = "live"
        tags                  = {}
        variables             = {}
        xray_tracing_enabled  = true

        access_log_settings {
            destination_arn = "arn:aws:logs:us-east-1:656889719924:log-group:/aws/apigateway/example-live-access-logs"
            format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date      = "2020-09-06T15:07:09Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-east-1:656889719924:m1oxmvsuek/bootstrap" -> (known after apply)
      ~ id                = "nv184z" -> (known after apply)
      ~ invoke_url        = "https://m1oxmvsuek.execute-api.us-east-1.amazonaws.com/bootstrap" -> (known after apply)
        rest_api_id       = "m1oxmvsuek"
        stage_description = "A basic stage created to remediate a race condition in API Gateway"
        stage_name        = "bootstrap"
      ~ triggers          = { # forces replacement
          ~ "redeployment" = "ea3cfc5c9c903322fe7e183ce5b7ee5d02acde4b" -> "1439cff46bf6433f5f2a420a1975a698f8418a34"
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "stage" {
        arn                   = "arn:aws:apigateway:us-east-1::/restapis/m1oxmvsuek/stages/nonlive"
        cache_cluster_enabled = false
      ~ deployment_id         = "nv184z" -> (known after apply)
        execution_arn         = "arn:aws:execute-api:us-east-1:656889719924:m1oxmvsuek/nonlive"
        id                    = "ags-m1oxmvsuek-nonlive"
        invoke_url            = "https://m1oxmvsuek.execute-api.us-east-1.amazonaws.com/nonlive"
        rest_api_id           = "m1oxmvsuek"
        stage_name            = "nonlive"
        tags                  = {}
        variables             = {}
        xray_tracing_enabled  = true

        access_log_settings {
            destination_arn = "arn:aws:logs:us-east-1:656889719924:log-group:/aws/apigateway/example-nonlive-access-logs"
            format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

Plan: 10 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```